gifs_backend_app_api/app/controllers/gifs_controller.rb

SELECT "gifs".* FROM "gifs" WHERE "gifs"."category" = $1  [["category", "cooking"]]
SELECT "gifs".* FROM "gifs"
---
  def index
    @category= Gif.where({category: params[:category]})

   @gif = Gif.all()

INSERT INTO "gifs" ("name", "category", "description", "gif_url", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @gif = Gif.new (gif_params.merge({user_id: @user.id}))

    if @gif.save

UPDATE "gifs" SET "name" = $1, "description" = $2, "updated_at" = $3 WHERE "gifs"."id" = $4  [["name", "i hate mark zuckerberg"], ["description", "mark zuckberg"], ["updated_at", "2020-10-04 03:02:25.118006"], ["id", 64]]
---
  def update
    if @user.id == @gif.user_id
    if @gif.update(gif_params)

DELETE FROM "gifs" WHERE "gifs"."id" = $1  [["id", 55]]
---
  def destroy


    if @user.id == @gif.user_id
    @gif.destroy

SELECT "gifs".* FROM "gifs" WHERE "gifs"."id" = $1 LIMIT $2  [["id", 55], ["LIMIT", 1]]
---
    def set_gif
      @gif = Gif.find(params[:id])